CSI API ETABS v1

# cCaseStaticNonlinearSetInitialCase Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetInitialCase(
    	string Name,
    	string InitialCase
    )

    Function SetInitialCase (
    	Name As String,
    	InitialCase As String
    ) As Integer

    Dim instance As cCaseStaticNonlinear
    Dim Name As String
    Dim InitialCase As String
    Dim returnValue As Integer

    returnValue = instance.SetInitialCase(Name,
    	InitialCase)

    int SetInitialCase(
    	String^ Name,
    	String^ InitialCase
    )

    abstract SetInitialCase :
            Name : string *
            InitialCase : string -> int

#### Parameters

Name

    Type: SystemString

InitialCase

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cCaseStaticNonlinear Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com